bot_token = "6383493043:AAG3I_ZMgdNQw97BR78r_EtBH55xtI5frLY"
api_id = 28482138
api_hash = "cdcd9c0f111f85feaafac50d1bc3d6a5"
proxy = True
proxy_address = ("socks5", "127.0.0.1", 2080)


bot_text = {
    "not_start": "کاربر عزیز به ربات خوش آمدید\nجهت استفاده از ربات ابتدا ثبت نام خود را کامل کنید",
    "enter_phone": "ابتدا از طریق دکمه زیر شماره تلفن خود را ثبت کنید:",
    "share_phone": "اشتراک گذاری شماره",
    "saved": "✅با موفقیت ثبت شد",
    "enter_name": "نام خود را وارد کنید:",
    "enter_city": "{name} عزیز، لطفا نام شهر خود را وارد کنید:",
    "start": "{name} عزیز، از شهر زیبای {city} به ربات خوش آمدی",
    "send_phone": "لطفا فقط از طریق دکمه اشتراک شماره اقدام کنید\nمجدد /start را ارسال کنید و روی دکمه اشتراک شماره کلیک کنید",
    "qua": "عدد شانس(کوا)",
    "zoo": "زودیاک",
    "enter_dahe": 'دهه تولد خود را انتخاب کنید:',
    "enter_year": "سال تولد خود را انتخاب کنید:",
    "enter_month": "ماه تولد خود را انتخاب کنید:",
    "enter_day": "روز تولد خود را انتخاب کنید:",
    "enter_gender": "جنسیت را انتخاب کنید:",
    "male": "مرد",
    "female": "زن",
    "qua_number": 'عدد شانس شما: {num}',
    "information": "اطلاعات دریافت شده:\nتاریخ تولد: {date}\nجنسیت: {gender}"
}


zoo = {
    0: "میمون",
    1: "خروس",
    2: "سگ",
    3: "خوک",
    4: "موش صحرایی",
    5: "اکسپرس",
    6: "ببر",
    7: "خرگوش",
    8: "اژدها",
    9: "مار",
    10: "اسب",
    11: "گوسفند",
}
zoo_about = {
    0: """
    متولدین سال میمون 🐒
مخترع ،محرک بداهه ،گو ،تیزهوش ،کنجکاو ،کنجکاو انعطاف پذیر ،نوآور حلال ،مشکلات به خود مطمئن، اجتماعی
وخوش مشرب ،هنرمند ،مودب با ،وقار ،رقابتی ،هدفمند واقع بین و خردمند این افراد بعضی اوقات خودبین
خودخواه بی ملاحظه مغرور گمراه کننده حیله گر حسود و مشکوک هستند.
    میمون شرور و حیله باز میمون در میان نمادهای دیگر طبیعتی غیر عادی و عجیب دارد او موجودی بدجنس موذی شیطان ،گستاخ شوخ طبع و همیشه در حال مسخره بازی است اما شوخیهای او غیر مستقیم و همراه با فریب
است.
او دوست دارد همه چیز را ببیند و بخواند همه چیز را برای خود خوب توضیح دهد و همیشه از تازه ترین اخبار روز دنیا آگاه شود.
میمون با سواد و با فرهنگ است و حافظه ای قوی دارد او میتواند در صورت لزوم حتی کوچک ترین جزئیات چیزهایی را که خوانده دیده و یا شنیده به خاطر بیاورد این ،ویژگی بسیار به او کمک میکند، زیرا میمون ذهنی پریشان دارد و از این رو تا حد زیادی متکی به خاطرات خود است.""",
    1: """
    متولدین سال خروس 🐓
حساس، شسته رفته ،دقیق با ،برنامه به خود ،مطمئن ،قاطع محافظه کار ،منتقد کمال گرا ،محتاط متعصب، عمل گرا، علاقمند به علم و .مسئول متولدین سال خروس گاهی خرافاتی و بیش از حد ایرادگیر خشکه مقدس، خودخواه، لجوج و بیش از حد به خود مطمئن میشوند.
    خروس به راحتی افکار و عقاید خود را بیان میکند و برای دفاع از گفتههای خود تا مرز پرخاشگری و ستیزه جویی می بی شک خروس صریح و صادق است و هر چه به فکرش ،برسد به زبان میآورد بی آن که نکته ای را از قلم بیندازد. او اهمیتی برای احساسات دیگران قائل نیست و هرگز درک نمیکند که چرا باید برای دیگران ارزش قائل شود. خروس معتقد است که همیشه حق با اوست و میداند چه کاری انجام میدهد او به هیچکس اعتماد ندارد و خود محور است و از طرف دیگر در نصیحت کردن دیگران پافشاری میکند و سنگ تمام می گذارد.""",
    2: """
    متولدین سال سگ 🦮
صادق هوشمند صریح ،وفادار سرشار از حس عدالت خواهی و ،منصف جذاب دوست داشتنی، بی تکلف، اجتماعی، روشن فکر، ایده آلیست و آرمان ،گرا با ،اخلاق عمل ،گرا ،مهربان ،حساس ،آسان گیر این افراد گاهی خیره سر، تنبل، سرد، بدبین جنگجو لجوج و ستیزه جو هستند
    شعار سگ: "من نگران هستم"
سگ دوست انسان است که میتواند او را درک کند و از او اطاعت ،کند چه صاحبش ثروتمند باشد و چه فقیر چینی ها سگ را حیوانی فرخنده و مبارک می.دانند اگر سگی وارد خانه ای شود صاحبخانه با آغوش باز او را خواهد پذیرفت.
افرادی که در سال سگ متولد شدهاند شخصیتی راست و درست .دارند. آنها در کار و عشق وفادار باجرات ،زبردست باهوش و دلسوز هستند این افراد اگر بتوانند بی ثباتی خود را رفع و رجو ،کنند شانس به سراغشان خواهد آمد.
بهترین جفت ببر ،خرگوش اسب
بدترین جفت اژدها، بز، خروس""",
    3: """
    متولدین سال خوک 🐖
صادق شجاع محکم خوش مشرب صلح ،دوست صبور وفادار سخت کوش ،معتمد ،صادق خونسرد، فهیم، متفکر، وسواسی، پرشور با هوش این افراد گاهی ساده لوح جبرگرا و مادی میشوند.
    شعار خوک: "من حفظ میکنم"
خوک در درک افکار انسانی به اندازه سگ دانا نیست عاشق خوردن و خوابیدن و چاق شدن است. از اینرو معمولاً نشانگر تنبلی و بدهیکلی است.
از جانب مثبت بسیار خوش رفتار است و آزاری به دیگران نمیرساند و میتواند برای مردم ثروت و فراوانی بیاورد آنها از دیرباز سمبل فراوانی و ثروت بوده اند. افرادی که در سال خوک متولد شدهاند افرادی صادق و رک گو هستند آنها ظاهری آرام و قلبی نیرومند دارند اما کم طاقتند و استقلال ندارند. از آنجا که از حرف زدن غیر مستقیم و در لفافه خوششان نمی آید غیر اجتماعی به نظر می رسند. اما افرادی خوشبین و مقاوم هستند و تا زمانیکه کاملاً به آنها نزدیک نشده اید پی به وفاداری و خوش قلبی آنها
نخواهید برد. 
بهترین جفت بز، خرگوش 
بدترین جفت مار خوک میمون""",
    4: """حال خوب = مال خوب
    متولدین زودیاک موش🐁
صریح، سرسخت ،محکم دقیق کاریزماتیک ،حساس سخت ،کوش جذاب اجتماعی ،هنرمند زیرک متولد سال موش گاهی میتواند با دقت شرایط را تحت کنترل قرار دهد. آنها گاهی میتوانند کینه جو خود مخرب، دروغگو، پول پرست، لجوج، منتقد بیش از حد بلند پرواز بی ،رحم متعصب و فریبنده باشد.
موش همیشه ،آشفته ناراضی و گاهی عصبی است و همواره بنا را بر گله و شکایت می گذارد.
موش فعالیت گروهی را دوست دارد اهل معاشرت و اجتماعی است؛ اما چون اغلب اطرافیانش اهل هیاهو و یاوه گویی هستند دوستان کمی دارد او موجودی تودار است عادت به خودخوری دارد؛ لذا به کسی اعتماد نمی کند.
او هر کاری را تا پایان دنبال میکند؛ حتی اگر بداند که شکست خواهد خورد و پایانی تلخ در انتظار اوست. اگر بتواند بر احساس نارضایتی همیشگی و علاقه بیش از حد خود به ابن الوقت بودن غلبه کند، موفق خواهد بود.
بهتر است موش با کسی که در سال اژدها به دنیا آمده رابطه برقرار کند؛ در این صورت قدرت و آرامش اژدها با زیرکی موش به خوبی سازگار می.شود. گاو نیز میتواند برای موش یار خوبی باشد. او در کنار گاو احساس امنیت می کند و اطمینان خاطر کافی را به دست می آورد.""",
    5: """
    متولدین سال گاو 🐄
قابل اعتماد بلند پرواز خونسرد هدفمند متولد این ماه رهبر به دنیا آمده، سخت کوش، پیرو صبور، سنت و آداب رسوم، ثابت و استوار ،متواضع، منطقی، مصمم محکم و با اراده هستند متولد این سال گاهی میتواند لجوج، کوته فکر، مادی غیر منطقی و سخت گیر باشد
    شعار گاو: "من پشتکار دارم"
گاو جثه بسیار بزرگی دارد مردم معمولاً از گاو برای نشان دادن یک چیز بزرگ استفاده می.کنند. گاو حیوانی کوشا ساده ،صادق، رک و روراست است.
افرادی که تحت این علامت به دنیا آمده اند افرادی صادق صبور زحمت ،کش ،سرسخت و با قدرت ارتباطی پایین هستند. رئیسانشان معمولاً هیچوقت پی به تواناییهای آنها نمی.برند در سنین ،پیری به خوشبختی خواهند رسید.
زنان این علامت معمولاً همسرانی خوب میشوند که به تحصیل فرزندان خود بسیار اهمیت می دهند.
گاو موجودی اندیشمند است و شاید به همین علت تنهایی را دوست میدارد
گاو بر خلاف ظاهر آرام ،خود حیوانی یک دنده و نافرمان است و از این که کسی پایش را در کفش او بکند بیزار است. گاو در خانه خود فرمانروایی توانا و بی چون و چراست که احترام و اطاعت همگان را بر می انگیزد.
او به وجود فرزندانش افتخار میکند ولی از آنان انتظار اطاعت مطلق دارد و در موردشان جدی و سخت گیر است. گاو رئیس خانواده است و حرف او به منزله قانون است ولی در عوض آماده هر نوع فداکاری برای خانواده اش می باشد.
بهتر است گاو از کارهای تجاری خدماتی که مستقیماً با مردم سرو کار دارد دوری .کند همچنین باید از کارهایی که نیاز به سفر دارد، پرهیز کند زیرا ممکن است تندرستی و آرامش روحی او را بر هم زند.
برای گاو عشق فقط یک سرگرمی خوشایند .است او میتواند ،مهربان باوفا و حتی با احساس باشد، ولی هیچ گاه عاشق نمیشود گاو علاقه ای به روابط عاشقانه ندارد و این گونه کارها را وقت تلف کردن میداند. در بیشتر موارد شکست گاو در مسائل عشقی و ازدواج ناشی از بینشهای مادی گرایانه اوست.
بهترین جفت موش مار خروس 
بدترین جفت ،اژدها ،اسب، بز، سگ خرگوش""",
    6: """
    متولدین سال ببر 🐅
غیر قابل پیش بینی ،سرکش ،رنگارنگ ،قدرتمند ،پرشور جسور ،نیرومند ،مهیج ،صادق ،مهربان نوع دوست، بخشنده و سخاوتمند. متولدین این سال گاهی بی ،قرار بی پروا بی تاب تند ،مزاج کله ،شق ،خودخواه پرخاشگر و دمدمی مزاج
هستند.
    شعار ببر: "من پیروز میشوم"
گفته می شود که ببرها ،حیواناتی شجاع ،بیرحم ،قوی و وحشت آور هستند و سمبل قدرت و تکبر می باشند. در زمانهای قدیم مردم معمولاً پادشاهان و فرمانروایان را با این حیوان مقایسه می کردند. افرادی که تحت این علامت به دنیا آمده،اند افرادی شکیبا ثابت ،قدم دلیر و قابل احترام .هستند. در میانسالی زندگی متغیر و نامتعادلی خواهند داشت اما بعد آینده و سرنوشتی بسیار روشن در انتظار آنها خواهد بود آنها افرادی باهوش باوفا و باتقوا هستند.
بهترین جفت اسب سگ
بدترین جفت مار میمون""",
    7: """
    متولدین سال خرگوش 🐇
بخشنده، بهترین دوست ،مهربان حساس دارای صدای نرم و ملایم ،شیرین زیبا کم ،حرف محتاط و هوشیار، هنرمند، بسیار دقیق، زودرنج ،خودسر خجالتی ،دانا ،دلسوز خوش شانس و قابل انعطاف متولدین این سال گاهی دمدمی مزاج، منزوی ظاهر ،بین خودپسند فرصت طلب و لجوج هستند.
    خرگوش داشتن کاریزمای بالا و انرژی بسیار بالا از مشخصه های افراد این ماه می باشد اگر داخل یک جمعی باشید همه شما را نشان میدهند و یا اگر وارد یک جمعی شوید قطعا همه متوجه حضور شما خواهند شد. در هر کار یا شغلی که مشغول هستید همیشه نامبر وان میباشد چرا که بسیار باهوش هستید ولی جالب است بدانید که گاهی وقت ها بدون این که دلیلی داشته باشید از کوره در میروید و حتی بی ادب نیز می شوید.
• طالب هیچ گونه قوانینی نیستید و گاهی حتی خودتان میخواهید که قانونهایی که شما اعمال کردید را بقیه نیز به آنها عمل کنند جزو آن گروه از مردم هستید که کاملا کمال گرا هستند و این باعث میشود که هم از خودتان و هم از اطرافیانتان انتظارات بالایی داشته باشید.
این افراد از حافظه ی خوبی هم برخوردارند آنها عاشق گفتگو و ارتباط با دیگران با شوخ طبعی هستند.""",
    8: """
    متولدین سال اژدها 🐉
سخاوتمند، با وقار ،نیرومند ،قوی مطمئن به ،خود ،مغرور خوش ،ذات صریح موقر ،حسود غیر عادی، خردمند، آتشین مزاج، پرشور ،قاطع پیش ،گام هنرمند بخشنده و وفادار متولدین این سال گاهی موقع نشناس گستاخ، متکبر، ظالم، سخت گیر بی ،گذشت متعصب خشن تند رو و بی حیا هستند.
    اژدها موجودی خوش خط و خال
اژدها سرشار از نیرو و شور نشاط زندگی است و تا هنگامی که جان در بدن دارد، از پستی، ناجوانمردی، دورویی و شایعه پردازی فاصله میگیرد و در وجود او نشانی از حیله گری
و دسیسه پردازی یافت نمی شود
افزون بر این به سادگی فریب می،خورد ولی در عین حال شهامت پذیرش اشتباه و اعتراف به آن را دارد.
او آرمان خواه و کمال گرا به معنی واقعی است به همین علت همیشه طالب بهترین هاست توقع او از خود و دیگران بیش از حد معقول .است وی از دیگران انتظار زیادی دارد وی در برابر انتظارات دیگران را تا حد امکان بر آورده می کند. اژدها بد خلق ،سرکش ،لجوج سرسخت و حاضر جواب است و اغلب بی اندیشه سخن می گوید اژدها در تمام عرصه های ،هنری ،مذهبی ،نظامی ،پزشکی یا سیاسی میدرخشد و کامیاب میشود. اژدها میتواند خود را وقف اهداف و کارهای با ارزش و بزرگ .کند این اهداف - هر چه که باشد او میتواند پایان کار را بسنجد""",
    9: """
    متولدین سال مار 🐍
متفکر، عاقل ،عارف ،ظریف دارایی صدای نرم و ملایم هوسران ،خلاق ،محتاط ،زیرک ،زیبا ،هوشیار، مسئول خونسرد قوی، ثابت قدم و هدفمند متولدین سال مار گاهی منزوی ضعیف در برقراری روابط اجتماعی دارای حس مالکیت شدید، مردد، بی ،اعتقاد ،دروغگو خاموش و سرد هستند.
    شعار مار: " من احساس میکنم"
در طالع بینی ،چینی مار پس از اژدها آورده شده است اما اهمیت آن به عنوان سمبل پرستش بسیار بالاتر از اژدها است. مار به معنای ،بدخواهی ،شرارت رمز و راز و همچنین ،تیزهوشی غیب ،گویی و توانایی تشخیص گیاهان مختلف
است.
افرادی که در سال مار به دنیا آمده اند معمولاً افرادی خوش اخلاق هستند که قدرت ارتباطی بسیار بالایی دارند. آنها سیرتی مهربان و بخشنده دارند اما گاهاً حسود و بدگمان میشوند باید مراقب گفتگوهای خود با دیگران باشند چون
ممکن است باعث از دست دادن دوستی هایشان شود.
بهترین جفت گاو، خروس
بدترین جفت ببر میمون خوک""",
    10: """
    متولدین سال اسب 🐎
شاد، محبوب تیز ،هوش قابل تغییر خاکی حساس و باهوش پر ،حرف هم از لحاظ جسمی و هم فکری فرز و سریع، جذاب، هوشمند دانا قابل انعطاف و روشن فکر متولدین این سال ممکن است گاهی بی ثبات، مکتبر، مضطرب، بی ادب، ساده لوح و گستاخ میشوند.
    اسب نجیب و برازنده اسب همیشه خود را آراسته و ستودنی مینماید جاذبه جنسی او خیره کننده است و می داند چگونه لباس بپوشد
اسب با شگردی خاص دیگران را زیر سلطه خود در میآورد و فرمان بردار خود می کند.
او همیشه راه خود را میرود و نصایح دیگران را قبول نمی.کند اسب خیلی زود آغوش خانواده را ترک می کند تا زندگی اش را بسازد او این کار را با میل و رغبت انجام میدهد زیرا زندگی مستقل و مطابق میل و سلیقه شخصی را بر هر چیز دیگر ترجیح می دهد.""",
    11: """
    متولدین سال قوچ ، بز ( گوسفند )🐐🐏🐑
نیکوکار و ،عادل ،دلسوز میانه ،رو خجالتی ،هنرمند ،خلاق ،نجیب ،مهربان ،فهمیده مصمم صلح ،جو دست و دل باز و به دنبال امنیت و آرامش این افراد گاهی دمدمی مزاج دو ،دل بیش فعال و نگران هستند
    شعار بز: " من متکی میشوم"
این علامت که گوسفند نیز خوانده میشود حیوانی است که مردم بسیار دوست میدارند. او حیوانی آرام و نجیب است که فایده های بسیار زیادی به انسان می رساند. افرادی که در سال پُز به دنیا آمده اند افرادی حساس مودب دانا و دلسوز و با محبت .هستند علاقه بسیار زیادی به هنر و زیبایی دارند در مذهب معتقد و خواستار آرامش در زندگی میباشند در کار و تجارت بسیار با احتیاط قدم برمی
دارند و افرادی صرفه جو و اقتصاددان .هستند آنها باید از تردید و ناامیدی و بدبینی دوری کنند.
بهترین جفت خرگوش، اسب، خوک
بدترین جفت موش، گاو، سگ""",
}